//2 Семинар


// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.WriteLine("Введите трёхзначное число: ");
// int number = int.Parse(Console.ReadLine()!);
// int a1 = (number / 10) % 10;
// Console.WriteLine(a1);



// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.WriteLine("Введите число");
// int number = int.Parse(Console.ReadLine()!);
// if(number < 100)
// {
//     Console.WriteLine("Третьей цифры нет");
// } 
// else 
// {
//     int a1 = number % 10;
//     Console.WriteLine(a1);
// }



// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine("Введите число от 1 до 7 для того, чтобы узнать, является ли этот день выходным");
// int number = int.Parse(Console.ReadLine()!);
// if (number == 6 || number == 7)
// {
//     Console.WriteLine("да");
// }

// else
// {
//     Console.WriteLine("нет");
// }

